In [1]:
import numpy as np
import pandas as pd

titanic_survival = pd.read_csv('titanic_train.csv')
titanic_survival.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
age = titanic_survival['Age']
# print(age.head())
age_is_null = pd.isnull(age)# Age为空的布尔值，空为True
# print(age_is_null)
age_null_true = age[age_is_null]
age_null_count = len(age_null_true)# Age为空的个数
print(age_null_count)

177

In [3]:
good_ages = titanic_survival['Age'][age_is_null==False]# 去掉缺失值
# print(good_ages)
# mean_age = sum(good_ages) / len(good_ages)# 求平均值
mean_age = titanic_survival['Age'].mean()# 求平均值
print(mean_age)

29.6991176471

In [4]:
passanger_survival = titanic_survival.pivot_table(index='Pclass', values='Survived', aggfunc=np.mean)# 根据平均值统计各等级舱位的获救人数
print(passanger_survival)

        Survived
Pclass
1       0.629630
2       0.472826
3       0.242363

In [5]:
passanger_age = titanic_survival.pivot_table(index='Pclass', values='Age')# 统计各仓位年龄
print(passanger_age)

              Age
Pclass
1       38.233441
2       29.877630
3       25.140620

In [6]:
port_stats = titanic_survival.pivot_table(index='Embarked', values=['Fare', 'Survived'], aggfunc=np.sum)# 查看两个数据间的关系
print(port_stats)

                Fare  Survived
Embarked
C         10072.2962        93
Q          1022.2543        30
S         17439.3988       217

In [7]:
# drop_na_columns = titanic_survival.dropna(axis=1)# 去掉含有缺失值数据
# new_titanic_survival = titanic_survival.dropna(axis=0, subset=['Age', 'Sex'])

In [15]:
# row_index_83_age = titanic_survival['Age'].loc[83]
row_index_83_age = titanic_survival.loc[83, 'Age']
row_index_766_pclass = titanic_survival.loc[766, 'Pclass']
print(row_index_83_age)
print(row_index_766_pclass)

28.0
1

In [17]:
new_titanix_survival = titanic_survival.sort_values('Age', ascending=False)
titanic_reindex = new_titanix_survival.reset_index(drop=True)# 重新设置索引
print(titanic_reindex.head(10))

   PassengerId  Survived  Pclass                                  Name   Sex  \
0          631         1       1  Barkworth, Mr. Algernon Henry Wilson  male
1          852         0       3                   Svensson, Mr. Johan  male
2          494         0       1               Artagaveytia, Mr. Ramon  male
3           97         0       1             Goldschmidt, Mr. George B  male
4          117         0       3                  Connors, Mr. Patrick  male
5          673         0       2           Mitchell, Mr. Henry Michael  male
6          746         0       1          Crosby, Capt. Edward Gifford  male
7           34         0       2                 Wheadon, Mr. Edward H  male
8           55         0       1        Ostby, Mr. Engelhart Cornelius  male
9          281         0       3                      Duane, Mr. Frank  male

    Age  SibSp  Parch      Ticket     Fare Cabin Embarked
0  80.0      0      0       27042  30.0000   A23        S
1  74.0      0      0      347060   7.7750   NaN        S
2  71.0      0      0    PC 17609  49.5042   NaN        C
3  71.0      0      0    PC 17754  34.6542    A5        C
4  70.5      0      0      370369   7.7500   NaN        Q
5  70.0      0      0  C.A. 24580  10.5000   NaN        S
6  70.0      1      1   WE/P 5735  71.0000   B22        S
7  66.0      0      0  C.A. 24579  10.5000   NaN        S
8  65.0      0      1      113509  61.9792   B30        C
9  65.0      0      0      336439   7.7500   NaN        Q

In [19]:
# 自定义函数
def hundredth_row(column):
    hundredth_item = column.loc[99]
    return hundredth_item

hundredth_row = titanic_survival.apply(hundredth_row)
print(hundredth_row)

100
0
2
Kantor, Mr. Sinai
male
34.0
1
0
244367
26.0
nan
S
PassengerId                  100
Survived                       0
Pclass                         2
Name           Kantor, Mr. Sinai
Sex                         male
Age                           34
SibSp                          1
Parch                          0
Ticket                    244367
Fare                          26
Cabin                        NaN
Embarked                       S
dtype: object

In [26]:
def not_null_count(column):
    column_null = pd.isnull(column)
    null = column[column_null]
    return len(null)

column_null_count = titanic_survival.apply(not_null_count)
print(column_null_count)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [27]:
def which_class(row):
    pclass = row['Pclass']
    if pd.isnull(pclass):
        return 'Unkown'
    elif pclass==1:
        return 'First Class'
    elif pclass==2:
        return 'Second Class'
    elif pclass==3:
        return 'Third Class'
    
classes = titanic_survival.apply(which_class, axis=1)
print(classes.head())

0    Third Class
1    First Class
2    Third Class
3    First Class
4    Third Class
dtype: object

In [31]:
def is_minor(row):
    age = row['Age']
    if age < 18:
        return True
    else:
        return False
    
minors = titanic_survival.apply(is_minor, axis=1)
print(minors.head())

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [33]:
def generate_age_label(row):
    age = row['Age']
    if pd.isnull(age):
        return 'Unknown'
    elif age < 18:
        return 'Minor'
    else:
        return 'Adult'
    
age_labels = titanic_survival.apply(generate_age_label, axis=1)
print(age_labels.head())

0    Adult
1    Adult
2    Adult
3    Adult
4    Adult
dtype: object

In [34]:
titanic_survival['age_labels'] = age_labels
age_group_surval = titanic_survival.pivot_table(index='age_labels', values='Survived')
print(age_group_surval)

            Survived
age_labels
Adult       0.381032
Minor       0.539823
Unknown     0.293785